ArtMoney Plugin
8.17//Verzió
Magyar fordítás:
Gábriel Géza
ifjgabrielgeza[no-spam]gmail.com
Névjegy
Game Cheater
<yyyy> <ms> <d>//date format
Copyright (C) 1996-2020, System SoftLab
Ha találnál néhány hibát
vagy javaslatod lenne írj ide (angol/orosz):
Frissítésekért látogasd meg az Artmoney honlapját:
Érték
Keresés
Szűrés
Értékek száma
Először válasz játék folyamatot
Most kezdj a folyamatban keresni
Szűrd amíg az egyező találatok meg nem szűnnek csökkenni
Sajnálom, nincs találat. Próbáld újra.
Letiltva
Találat:
cím
cím
cím
A táblában
Betöltés hiba
Keresés hiba
Szűrés hiba
A fájl formátum nem támogatott
Nem értelmezett szám a kívánt típushoz
Nem tudom betölteni
Keresés folyamat
Szűrés folyamat
minden lehetséges
byte
byte
byte
Nem megfelelő módszer, próbálj másikat.
mp
p
Nem választottál ki típust ehhez a módszerhez
A típus mérete nem lehet több ennél:
módosult
nem lett módosítva
megnövelt
csökkentett
A tábla újabb verzióval lett elkészítve
A tábla sérült
Fájl elérési hiba
Integer 1 byte
Integer 2 byte
Integer 3 byte
Integer 4 byte
Integer 8 byte
Float 4 byte
Float 6 byte
Float 8 byte
Float 10 byte
Szöveg
Null-végű string
Null string
Pascal string
R.Integer 2 byte//R.=Visszafelé, Reverse
R.Integer 3 byte
R.Integer 4 byte
R.Integer 8 byte
R.Float 4 byte
R.Float 6 byte
R.Float 8 byte
R.Float 10 byte
R.Szöveg
R.Null String
R.Pascal string
Január
Február
Március
Április
Május
Június
Július
Augusztus
Szeptember
Október
November
December
F//F=Fagyasztás
Súgó
Névjegy
Folyamat kiválasztás
Töröl
Betölt
Mentés
Hozzáad
Mind hozzáad
Szerkeszt
Másol
Töröl
Fagyaszt
Fagyasztás le
Eltolás automata alkalmazása
Infó
Folyamattípus
Idő fagyasztás (ms)
Idő frissítés (ms)
Nyelv
Címek mutatása
Ablak gyorsbillentyű
Általános
Egyéb
Személyes
Email
Alapértelmezett megjegyzés
Operációs rendszer
Decimális formátum
Byte rendezés
Keresés prioritás
magas
teljes
Opciók
Mégsem
Normál
Cím szerkesztés
Fagyaszt
Méret
Cím
Leírás
Típus
Fordít
Pontos Érték
Érték sor
Érték táv
Ismeretlen érték
Kódolt érték
Egyéb
Típus kiválasztás
Byte sorrend
Normális és fordított
MIND
Integer
Float
Kezdés időpontja:
Hátralévő idő:
Sebesség:
Találat:
Játék
Megjegyzés
Dátum
Rendszer
Tábla információ
Készítő
Név
Hely
Sorozat bevitele
Gyorsbillentyű beállítás
Fordít
Keresés a memória blokkban
Keresés cím távban
Tárhely beosztás
tól
ig
Keresés
Szűrés
Lépés
Lépés//Érték beállítás
Érték beállítás
Mind kiválaszt
AUTO
Folyamatok mutatása
Látható
Windows - al
Folyamatinformáció
Folyamat befejezése
Ablak mutatás
Ablak rejtés
Biztos vagy a folyamat befejezésében?
Hozzáférés megtagadva
Nem lehet befejezni a folyamatot
Fájlnév
Folyamat típus
Adat méret
Benchmark
Benchmark a memória keresés sebességének megállapításához
Várj
Rendszer
Speciális gyorsbillentyűk
Hozzáadás az értékhez
Ablak zárolása
Szűrés Visszavonás/Ismétlés engedélyezve
Integer nézet
Jelöletlen
Jelölt
Szűrés visszavonás
Szűrés ismétlés
Szűrés mentés
Szűrés betöltés
A jelenlegi lépés
"Szűrés visszavonás" nincs bekapcsolva
"Szűrés ismétlés" nincs bekapcsolva
"Szűrés betöltés" nincs bekapcsolva
emelési értéke
csökkentési értéke
Megjelenés
Gyorsbillentyűk
Gyorsbillentyűk engedélyezve
Gyorsbillentyűk alapként
Alapértelmezett betű
Tábla betű
Alapértelmezett szín
Színek szerkesztése
Gomb színek
Ellipszis gomb
OK
Memória szerkesztő
Hexadecimális nézet
Hexadecimális szerkesztés
Érték oszlopok száma
Cella nézet
Jelenlegi cella
Áthelyezés
áthelyezés keresési találatokban
áthelyezés táblákban
áthelyezés memória blokkokban
áthelyezés címekbe
Első
Előbbi
Következő
Utolsó
Teljes
Jelenleg
Rész másolás
Rész beillesztés
Hozzáadás táblához
Mind (standard)
Integer (standard)
Float (standard)
Kijelölés fordítás
Oszlopok igazítása
<NEM>
Mutató
Frissít
Kiválasztás szerkesztése
Csoport
Látható csoport
Csoport kiválasztás
Jelenlegi cím/mutató mentése
Automata eltolás alkalmazás mindre
Automata eltolás alkalmazás a csoportra
Automata mentési cím eltolás alkalmazás mindre
Automata mentési cím eltolás alkalmazás csoportra
Parancsok a mutatókkal
Mutató beállítás mindhez
Mutató beállítás csoporthoz
Mentési mutató beállítása mindhez
Mentési mutató beállítása csoporthoz
Mutatók beállítása ehhez a címhez
Mutatók beállítása a mentési címhez
Mutató keresése ehhez a címhez
Mutató keresése a memória blokk elejéig
Rendezés
leírás szerint
cím szerint
érték szerint
érték mint szöveg szerint
csoport szerint
Egyesítés
Egyesítés hiba
Mindkettő tábla csak egy szerzőtől származhat
Aktuális folyamat kiválasztása
Charset
Látható csoport panel mutatás
a csoportban
Mutatók konvertálása címekké
Szűrő beállítás
String
<Fájl nem található>
<Hozzáférés megtagadva>
Fájl szerkesztő
Hibák
<Méret ­ utánna>
Skin
Nincs Skin
Betű módosítás
Tábla szín
Memória dump mentés
Formula használat
Folyamat
Folyamat leállítás
Folyamat folytatása
Folyamat mentés
Folyamat betöltés
Folyamat ID
Részek
Fájlok
Fájl információk
Fájl kiválasztás
Mappa kiválasztás
Fájlok száma
Teljes méret
Áthelyezés a mappában
Cél
Tábla
Kilép
Eredmény
Több
"ArtMoney Pro" megvétele online
Honlap megnyitása
ArtMoney kezelési útmutató
Kódolás
Kódolás kiválasztás
Fényerő
Színárnyalat
Főmenü mutatás
Nem készítői nyelvi plugin használat
Folyamat leállítása keresés alatt
Mentés/Betöltés értékek a fájl-táblában
Library a folyamat nézőkéhez
Mappa opciók
Fájlnév maszk
Módosítási idő
Fájl dátum
Fájl idő
Nincs ellenőrzés
Utolsó 15 perc
Utolsó óra
Utolsó nap
Utolsó hónap
Utolsó év
Több mint
Kevesebb mint
Ez a lehetőség csak az ArtMoney Pro kiadásban fellelhető
Csak Armoney Pro-ban
Licenc Szerződés
Egyetértek a Licenc Szerződés feltételeivel
A PRO kiadásról
Speciális köszönetek
felhasználói kézikönyv design
logo:
telepítő modul:
ikon készítés:
az angol kézikönyv nyelvi ellenőrzése:
segítségek:
skin motor (ThemeEngine csomag):
tanácsok és értékes észrevételek:
fordítások:
táblák:
Regisztrációs szám
Nem regisztrált
Ne kérje be többször a kódot
Csak a jelenlegi Windows felhasználónak
Folyamat befejezés és felugró ablak
Átváltás és folyamat folytatás
Felesleges zárójel
Hiányzó zárójel
Felesleges bezáró idézőjelek
Helytelen ID
Helytelen argumentum szám (M1,M2...)
Helytelen művelet szám (-,+)
Helytelen állapot szám (<,>,=)
Helytelen kifejezés szám
Helytelen kifejezés
Ez a lépés nem létezik
Helytelen állapot
Helytelen paraméter:
Nincsenek állapotok
Keresés...
Regisztráció
Kód
Kérlek írd be a kódot és klikkelj az "OK" gombra
Rossz kód
Rossz kulcs fájl
Nincs kulcs fájl
Alapértelmezett
Felhasználói megszakítás
Kézikönyv
A folyamat nem található
Csak űrlap fókusszal legyenek frissítve a tábla értékek
Kód méret
Folyamat térkép
Régió cím
Állapot
Régió védés
Védés
Modul név
Ez csak Windows 2000/XP/2003/VISTA/2008/7/8/2012/10 rendszeren működik
Folyamat mentése/betöltése
Mód
Helytelen folyamat. A folyamat módosult vagy újraindult.
Bezár
Excelben
Float értékek kerekítése
Macromedia Flash
Táv
Folyamat memóriába tartása
Lefoglalt fizikai méret
Új folyamat futtatása
Telepít
Parancsikon létrehozás az Asztalra
Folyamat elrejtés
Folyamat felfedés
Emulátor
Játék rendszer
Cím táv
Emulátor opciók használata
Emulátor memória térkép
Emul.cím
PC cím
Szeretnéd az emulátor címet PC címre alakítani?
Szeretnéd a PC címet emulátor címre alakítani?
Cím fordítási hiba
Automatikusan érzékelje az emulátort fájlnév alapján
Csoportok
Csoport fa megjelenítés
Egyik sem
Bal
Jobb
Új csoport
Alap
Nyelv
Szeretnéd törölni ezt a nyelvet?
Szeretnél hozzáadni egy új nyelvet?
Szeretnéd átnevezni ezt a nyelvet?
normál fagyasztás
növelhető
csökkenthető
minimumtól maximumig
Minimum
Maximum
Kiválasztott másolása
"Spyware Process Detector" program letöltése
Nem található "Spyware Process Detector" program a számítógépen. Letöltheted és telepítheted cégünk www.systemsoftlab.com oldaláról. A program képes együtműködni az ArtMoney programmal folyamat kiválasztóként; a "Spyware Process Detector" program használatával megnyithatsz bármilyen rejtett folyamatot ami megnyitást blokkol. Részletes informáviót jelenít meg a PC-n futó folyamatokról és érzékel új (antivírus által nem érzékelhető) kém, trójai vagy vírus programokat.
Ötletek vagy hibák visszajelzése
Látogassa meg honlapunkat és töltsön le más programokat is
Ingyenes LIMITED verzió. A teljes verzió csupán $24.90-ba kerül, az egyszeri vásárlással a későbbi frissítések ingyenesek!
Csak a regisztrált felhasználók kapnak teljeskörű technikai támogatást és használhatnak minden extra szolgáltatás.
A vásárlás megkezdése előtt győződj meg róla, hogy rendelkezel élő Internetes kapcsolattal, majd kattints az Online regisztrálás gombra alább.
Online regisztrálás
Szolgáltatás telepítés
A Windowsnak szüksége van felhasználói azonosításra a szolgáltatás telepítéséhez.
Telepítés a következő felhasználóval
Felhasználó
Domain
Szolgáltatás telepítési hiba, a hozzáférés megtagadva.
Sikertelen bejelentkezés
Rejtőzködő mód
Folyamatom elrejtése
Ablakom elrejtése
Régi szolgáltatás verzió van telepítve. Kérlek, indítsd újra a számítógépet az új verzió telepítéséhez.
A tábla módosítva
Szeretnéd menteni a módosításokat?
Rákérdezés nem mentett tábla módosítások mentésére kilépéskor
Struktúra
Átlépve
Mező
A struktúra méret nem lehet nagyobb mint
Elem
Új elem
Tábla struktúra keresése
Csoport struktúra keresése
Kiválasztott című struktúra keresése
Feljebb
Lejebb
Ingyenes "ArtMoney Pro"
az orosz kézikönyv nyelvi ellenőrzéséhez
Kerekítés típus
Kerekítés közelebbi-felé
Kerekítés le
Kerekítés fel
Kerekítés nulla-felé
Folytatás
Ingyenes beszerzés
Visszafejtő
Assembly utasítás
Modul címzés
Modul
Cím a modulban
Konverzió hiba
Nem konvertálható modul cím: Nincs ilyen modul a folyamatban.
Rendszer modulok memóriaterületének keresése
Megosztott modulok memóriaterületének keresése
Folyamat hiba megnyitása
Nem nyitható meg a folyamat.
Próbálja ki a PRO kiadást.
A táblához PRO kiadás szükséges
Érvénytelen register
Érvénytelen cím
Érvénytelen érték
Az érték túl magas
Érvénytelen assembly utasítás
Kémprogram-figyelő futtatása rendszergazdaként. Kattints jobb gombbal a program ikonján és válaszd ki a környezeti menüben a "Futtatás rendszergazdaként" lehetőséget.
Szolgáltatás indítási hiba
Szolgáltatás megnyitási hiba
Próbáld a számítógépet újraindítani
módosítva ennyivel:
Tábla konverzió
Szeretnéd tábládat 64-bit módra konvertálni?
Szeretnéd tábládat 32-bit módra konvertálni?
Konverziós hiba lépett fel. A program nem tudja a címet 32-módra konvertálni.
Cím előfordulások//Address divisibility
Egyenlő//Divisibility by 2
Több
4 többszöröse//Divisibility by 4
8 többszöröse//Divisibility by 8
16 többszöröse//Divisibility by 16
Csak statikus címek keresése a modulokban
Modul opciók megjelenítése
Regisztrációs kód bevitele
Kérem, illessze be a regisztrációs kódját (Ctrl-V vagy "Beilleszt" gombok) és kattintson az "OK"-ra
Beilleszt
A regisztrációs kód érvénytelen
A regisztrációs kód csak angol verzióhoz érvényes
A regisztrációs kód csak orosz verzióhoz érvényes
A regisztrációs kód csak régi verzióhoz érvényes
A regisztrációs kód már nem működik. Kérem, vegye fel a kapcsolatot a sales@systemsoftlab.com címmel új regisztrációs kódért
Amennyiben Ön nem látja itt nevét és adatait, Ön feltört vagy eltulajdonított verziót használ, ezen verzió pedig helytelenül működhet!
Mutató a mutatóhoz
Maximum eltolás
Szintezés kezdet
Mutató keresése a mutatóhoz
Maximum 2 szint az SE kiadásnál!
Próbáld az illesztőprogram aláírás-ellenőrzésének kikapcsolását
Gyors mód (több memóriát használ)
Mb
Eltolás automatikus alkalmazása és másolás az új csoportba
Blokkban lévő cím
Nem tudom konvertálni a blokkban lévő címet: Nincs ilyen blokk a folyamatban.
Konverziós hiba: Nem egyedi a blokk mérete.
Mutatók rendezése eltolás szerint
Szöveg elrejtése teljes rejtettség módban//VIP only
Online játékfiókok eladása és vétele
Új verzió tölthető le
Új verziók keresése
Mutató eltolással
Mutató keresése maximum lehetséges eltolással
2. lépéstől érhető el
Formula
Verzió
Mindig felül
"Mindig felül" bekapcsolása
"Mindig felül" kikapcsolása
Ellenőrizd a hálózatot! A systemsoftlab.com nem nyitható meg
Próbálkozás opcióval
Név/Modul
Hex kód
Regisztrál
Zászló
Debugger csatolás
Debugger leválasztás
Csatolod a debuggert a kiválasztott folyamathoz?
Töréspont lista
Utasítások
Debug
Debug információ mentése
Debug információ betöltése
Assembly nyelv
x86-32 bit
x86-64 bit
Töréspont
Töréspont hozzáadás
Töréspont eltávolítás
Futtat
Futtatás mérték
Visszatérés
Nyomkövetés lépték
Nyomkövetés lépés vége
Cím elnevezése hozzáadása
Cím elnevezés törlése
Igen
Nem
Debugger típus
Standard
Kivételkezelés
Futtatható fájl töréspont-típusa
Szoftver (int3 utasításkészlet)
int3
Debug regiszterek (max 4)
regiszter
Oldalhibák
kivételek
Töréspont típus hozzáférés
Legyen kérdés a debugger folymathoz csatolásánál
Szoftver töréspontok használata, ha már minden debug regiszter használt
Debug infó automatikus mentése/betöltése
Debug szimbólumok használata
Szimbólum elérési út
Aktív
Megszakít
Végrehajt
Bármely hozzáférés
Írás
Feltételek
Módosítások
MIND be
MIND ki
Olyan utasítás keresése, ami hozzáfér a címhez
Memória hozzáférésnél
Memória írásnál
Feltételek hiba
Módosítások hiba
Nullával osztás
Olvasási hiba
Írási hiba
Rossz bal oldal
Start
Állj
Hozzáférés
Eredmény törlése
Felosztás szálanként
Szám
Szál
8-bit
16-bit
32-bit
Hex
Hex
Float4
Float8
Hex szekvencia
nincs systemsoflab.com szerver válasz vagy internet kapcsolat
Letiltott regisztrációs kód
A kód csak kétszer aktiválható naponta
A regisztrációs kód csak VIP Edition-ra jogosít
Debugger elrejtése
Unicode formátumú tábla mentés
Méret beszerzés funkció végéig (visszatérésig)
Licencek
Scan memory regions
data writable
data readonly
code writable
code readonly
shared
system
guarded
hidden
Multiplicity of each address
Address names and symbols list
Folder symbols
User names
Case sensitive
Whole words
First position
Read/Write
Auto detect size of functions
Hide debug registers
Patch this functions (structures)
Védelem megkerülés
Saját funkciók használata memória eléréséhez
User mode functions (attach to the process)
Kernel mode functions (via driver)
Attach to the process without OpenProcess
Signatures
Signature search
Add signature
Offset
Auto search
Static adress
Regions
Edit as the assembly code
As assembly code
Convert to HEX
Limit unique offsets per level
Code replacing
Replace the code
Replace all codes simultaneously
<REPLACED>
<NOT REPLACED>
<NO MODULE>
<NO BLOCK>
<NO SIGNATURE>
<NO VARIABLE>
Code injecting
Inject the code
Only after successed code replacing
Automatically replace all codes and inject
Allow to automatically replace all codes and inject
Ask for permission to automatically replace all codes and inject
The table contains a code for injection and replacement. It can be malicious code! Download tables only from most trusted websites! Do you want to inject the code in the process?
Replace all codes and inject
Cancel code replacing and injecting
Signature
Original Signature
Wrong original signature
Address of signature//full
Address of sign.//short
Address of variable/label//full
Address of variable//short
I can not convert the address of signature: No such signature.
I can not convert the address of variable: No such variable.
Name//variable or label
Code size for replacing 
One assembler instruction
Several assembler instructions
Line
Relative addressing error (offset is too big)
Invalid multiplier
Back jmp error
Cannot allocate memory
Areas//Memory areas
Set mirror address
Clear mirror address
from the minimum address
Service
Show pointer offsets in hexadecimal
Use RAX(EAX) register. Only MOV instruction with RAX(EAX) register can read/write an absolute address!
Change process speed
Your speed (%)
Normal//Speedd
Change process speed error
Increase process speed
Decrease process speed
Stack
View as stack
Save thread stack
Return adress
Parameter
Parameters
Show parameters in one line
Return address only in module
Read Memory Error
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D75CFCDE